# AssociatedAssemblyInstanceId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..AssociatedAssemblyInstanceId Property
View Class See Also
---
The Id of the assembly instance that owns the assembly view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId AssociatedAssemblyInstanceId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AssociatedAssemblyInstanceId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ AssociatedAssemblyInstanceId {
	ElementId^ get ();
}
```

# See Also
View Class
Autodesk.Revit.DB Namespace